app/controllers/quotes_controller.rb

  def index
    @quotes = Quote.all
---
SELECT `quotes`.* FROM `quotes`

  def create
    # @quote = quotes.new(title: "...", body: "...")

    @buildingtype= params[:buildingtype]
    @numofapt= params[:numofapt]
    @numoffloors= params[:numoffloors]
    @numofbase= params[:numofbase]
    @numofpark= params[:numofpark]
    @numofcomp= params[:numofcomp]
    @numofelev= params[:numofelev]
    @maxocc= params[:maxocc]
    @bushrs= params[:bushrs]
    @corp= params[:corp]
    @liftCage= params[:liftCage]
    @elevatorNum= params[:elevatorNum]
    @unitPrice= params[:unitPrice]
    @totalPriceElevators= params[:totalPriceElevators]
    @installFees= params[:installFees]
    @totalPrice= params[:totalPrice]

    @quote = Quote.new(buildingtype: @buildingtype, numofapt: @numofapt, numoffloors: @numoffloors, numofbase: @numofbase, numofpark: @numofpark, numofcomp: @numofcomp, numofelev: @numofelev, maxocc: @maxocc, bushrs: @bushrs, corp: @corp, liftCage: @liftCage, elevatorNum: @elevatorNum, unitPrice: @unitPrice, totalPriceElevators: @totalPriceElevators, installFees: @installFees, totalPrice: @totalPrice)

        respond_to do |format|
          if @quote.save
---
INSERT INTO `quotes` (`buildingtype`, `numoffloors`, `numofbase`, `numofpark`, `numofcomp`, `maxocc`, `bushrs`, `liftCage`, `elevatorNum`, `unitPrice`, `totalPriceElevators`, `installFees`, `totalPrice`, `created_at`, `updated_at`) VALUES ('hybrid', 12, 11, 23, 14, 54, 12, 'premium', 1, '$12,345.00', '$12,345.00', '$1,604.85', '$13,949.85', '2022-03-14 03:21:57', '2022-03-14 03:21:57')